In [9]:
import pandas as pd

In [16]:
##read_csv,read_excel,read_json,read_sql

In [17]:
data = pd.read_csv("Data.csv")

In [18]:
type(data)

pandas.core.frame.DataFrame

In [19]:
data

     Name  Age      Contact
0    Riya   18     98365702
1      Tj   18    823958203
2     Dev   19     34752042
3     Par   56      9275894
4    Gach   78     92539049
5    NJKA   89  93254839040
6  HIJKSA   45       239375

In [20]:
data.head()#first 5 rows

   Name  Age    Contact
0  Riya   18   98365702
1    Tj   18  823958203
2   Dev   19   34752042
3   Par   56    9275894
4  Gach   78   92539049

In [21]:
data.tail()#last 5 rows

     Name  Age      Contact
2     Dev   19     34752042
3     Par   56      9275894
4    Gach   78     92539049
5    NJKA   89  93254839040
6  HIJKSA   45       239375

In [23]:
data.columns

Index(['Name', 'Age', 'Contact'], dtype='object')

In [25]:
len(data.columns)

3

In [27]:
data.describe()

             Age       Contact
count   7.000000  7.000000e+00
mean   46.142857  1.347342e+10
std    29.639099  3.518151e+10
min    18.000000  2.393750e+05
25%    18.500000  2.201397e+07
50%    45.000000  9.253905e+07
75%    67.000000  4.611620e+08
max    89.000000  9.325484e+10

In [34]:
pd.DataFrame(data.iloc[0:2,0:2] )#rows : columns

   Name  Age
0  Riya   18
1    Tj   18